{"uuids": ["e6714f9d-a8b6-4821-b08f-8be03786a0e7", "400b7478-ceac-40c1-880c-caf6e8ce6fe4", "c9a6129e-d485-4cf2-89d7-a153dfc46305", "36d6d539-5043-4792-a6bb-748ee1690a66", "902d8d4c-18e7-4a03-a240-cdcb571fdb47", "ef72adb5-a8e5-4374-a1c3-6a8b4dead331", "b2eb6f71-ad35-4e0b-8d00-8a079593b5ef", "5a8f74f0-eb56-497d-9e34-2589ce9a95b6", "27b5d99d-c89b-4158-8130-e875f5b81c80", "9b5e99b5-f79d-4b48-9b9c-2cbc41b91b5d", "544d438b-7206-41ce-958b-ea96ebf2c905", "c5b357a8-1f8d-45ac-8ee9-1767b2427b28", "52b8b821-5767-443c-bcfc-db14caec642e", "981de398-d286-4caa-9840-9b5b04091b36", "93836d43-cd57-4b55-9b22-29c6fcf05fb7", "66457a3d-ef03-40ee-adb0-0e95c6606f82", "db1f0959-4662-407d-9e72-74607f8191ad", "e301257a-cd16-4cb4-bb89-c21ce9c78204", "fd4bdc80-5935-4189-a950-5aa1827d09c3", "314129ff-03c9-4d65-8d79-227cb4327471", "ec703819-0817-4de9-a893-f5abbdef7fc0", "6c2a505e-88ab-45ee-9064-6e53d5f9367d", "610139c8-64f1-4ff6-9476-a2d1d286763f", "a67eda75-c57d-4cb6-b7e5-a2310fe7c1b3", "cd6ae22f-7b70-4f22-83f9-1074c10ff55c", "119d8f40-c0bc-4518-a5f6-3c251a83b28f", "85e73383-9c47-4027-bdc1-6c0b4f165254", "f2f1c05c-8fd0-4a5f-8890-4e4f8c37b0a9", "9ed6bc51-4800-4266-b10d-d0c23a03d957", "c943b938-cbf8-4dde-bc1c-6ceb1a64b83e", "605705f7-dbeb-47fc-9c04-078a7aa3b225", "0f4aeb5f-9ce9-4f19-8410-f09d74545ea2", "a4c2889b-c922-4155-bdb2-d2816b3d49b8", "d546444e-313a-4c2c-9f48-bb9f2a5d0336", "badda000-4aba-4b80-9864-2b2f9cc299cb", "994f6889-0d9f-4fd8-8891-a8b4c7c5fd8f", "14702a89-14c1-420a-b9c9-6e64457c8d84", "af014be1-1fc3-4508-bf22-74dcd7d6acf5", "3fef6e13-a4aa-476c-acb3-833b571d81fe", "2700495b-88da-440d-a7ee-b4bffef41e33", "5c10237c-3e22-4c79-8076-5a5a3b8aa923", "309d5fcd-0569-4290-926e-42d6c991295b", "cb7f82c8-baec-403c-95d5-0db24f0327a3", "49113409-9d33-43c8-b17e-19c9461f903d", "48140d92-4b23-4940-8d1f-5d3c1a920fa5", "40f5061a-efb6-4762-9997-231dabbfbc33", "d8d6e576-1e30-483e-80dd-aeeac29e03c3", "44830dae-ac7f-4522-ac48-fb32b915039d", "8e7e0416-0234-471d-877e-d285e48e9a9a", "afd5c334-a8ec-44ed-846a-b155faf3f902", "71f86927-df23-4218-9f92-7c02d0883456", "9a0a4ed7-753e-49a9-93c5-2eeea853f8c6", "936d0a8e-0b75-41ed-bb61-ba09e6163dcf", "0095418e-9f24-41ca-88c8-0762db969ad9", "df175f49-e46d-4b2d-a1d0-1212c405734c", "1a4ce27c-7e8c-40a3-828a-e53690086bdd", "605f1ffb-2bd7-4d06-b6ac-609a88d9b1a3", "bc26c469-2f60-4c5f-ba73-4aace1dda996", "a350193a-bfa4-498d-a6b5-5bae8d1a17aa", "a261d2bd-23fb-46dc-9c38-33314fec00a1", "dd8e63eb-5d75-432c-878c-d8648dcda693", "56fe760b-cab8-4fdd-a2ff-cf7f212c7083", "b8e4fe2f-5ef8-41af-b175-55c82a4ce049", "2802da46-162b-47e1-b7d6-f65995920d7a", "8240b8e2-a176-48f1-860b-d17bd776ea28", "986ba18a-ef81-4f2b-b41e-9b0902dea675", "e44e383d-0ca1-486d-851c-0245bf073f7d", "8e94fa88-53b7-49dd-bce5-fde3c28471bf", "468341a3-6eac-4c43-a4f1-ccd7341198d0", "70162492-d0e5-4564-9df0-5f836ca12361", "c2241c9b-be43-44d1-987a-e45f91e2c7bd", "febfc82a-088b-42ce-8b9f-6b7aa356817c", "db54980e-c9cb-4ae3-8aca-ba3e5ffb1df8", "c21bf6ce-e92c-4f39-94f6-3c11055f5335", "4b308f24-2f05-446e-b180-b53354b352e3"], "gene_function": ["encodes a gap junction protein; expressed in 4-6 anterior neurons.INX-1 functions upstream of PKA in the GABAergic neurons to negatively regulate enteric muscles.", "encodes a homeodomain protein that is a member of the OTD/OTX subclass of homeodomain transcription factors.", "encodes a homeodomain protein of the ZFH class which consists of a homeodomain flanked by two clusters of C2H2-type zinc fingers. ZAG-1 is required for locomotion, for neuronal differentiation, and for proper axonal branching and fasciculation; from late embryogenesis through adult stages of development, ZAG-1 is expressed dynamically in head and tail neurons and in the intestinal and anal depressor muscles.", "encodes a homeodomain protein homologous to Drosophila bsh (brain-specific homeodomain protein) and the vertebrate BarH-like homeodomain protein 1. TAB-1 expression in AIB may be controlled by the UNC-42 homeodomain protein and TAB-1 may autoregulate in the AVJ and RIV neurons.", "encodes a homeodomain protein of the ZFH class which consists of a homeodomain flanked by two clusters of C2H2-type zinc fingers", "encodes a LIM homeodomain protein required for functions of the interneuron AIY, including thermosensory behavior and olfactory learning.", "encodes a basic helix-loop-helix (bHLH) transcription factor.", "a homeodomain proteinof the NK-2 class that contains Drosophila scarecrow and human NKX-2; CEH-27 activity is essential for embryogenesis and appears to be required for maintaining hypodermal integrity during movement as embryos lacking CEH-27 burst at a breach in the ventral hypodermis upon commencement of muscle contractions.", "ceh-24 encodes an NK class homeodomain protein orthologous to human NK2 Homeobox 1 (wormbase)", "egl-46 encodes a transcription factor with similarity to the TFIIA-like zinc-finger protein family; egl-46 activity is required for coordinated locomotion, morphology and process formation of the touch cells, male mating efficiency, HSN cell migration, differentiation, and axonal outgrowth, serotonin production and also terminal divisions of the Q neuroblasts (worm base).", "hlh-16 is an ortholog of human OLIG2 (oligodendrocyte lineage transcription factor 2), OLIG3 (oligodendrocyte transcription factor 3) and OLIG1 (oligodendrocyte transcription factor 1); hlh-16 is involved in reproduction (worm base).", "lim-4 encodes a LIM homeodomain protein homologous to murine Lhx6 and L3/Lhx7, and to Drosophila ARROWHEAD; LIM-4 is required for differentiation of AWB chemosensory neurons, for several but not all aspects of RID motor neuron differentiation, expression of ser-2, repulsion from chemosensory repellants, SAA neurite outgrowth, and normal locomotion and head foraging (worm base).", "odr-2 encodes three isoforms of a predicted membrane-associated protein related to the Ly-6 (leukocyte antigen-6) family of GPI (glycosylated phosphatidylinositol)-linked signaling proteins; ODR-2 activity is required for proper functioning of the AWC olfactory neurons and thus for chemotaxis in response to AWC-sensed odorants (worm base).", "encodes a basic helix-loop-helix (bHLH) transcription factor that is the C. elegans ortholog of the myogenic regulatory factor (MRF) subgroup of bHLH proteins; in C. elegans, HLH-1 activity is required during embryogenesis for proper bodywall muscle development and function.", "encodes, by alternative splicing, at least three isoforms of a GPI-anchored immunoglobulin superfamily (IgSF) protein orthologous to Drosophila KLINGON, WRAPPER, CG7166, and CG13506; WRK-1 is expressed in the pioneering embryonic motoneurons (eMNs) DA, DB, and DD; WRK-1 expression in DA, DB, and DD is necessary and sufficient to prevent follower axons from inappropriately crossing the ventral midline; WRK-1 also retards developmental changes in the outward current of maturing AIY interneurons; in addition to eMNs and AIY neurons, WRK-1 is expressed in ASI and SMDV/D neurons, along with sheath and socket cells, intestine, the excretory gland cell, distal tip cells, and coelomocytes.", "is an ortholog of human ROBO4 (roundabout guidance receptor 4); rig-1 is involved in embryo development and reproduction.", "encodes an ortholog of calcineurin A that is required for inhibition and adaptation of several sensory neurons and for the normal regulation of egg-laying by serotonin. TAX-6 stimulates transcription of rcn-1, and binds RCN-1 protein if free Ca[2+] is present; in general, calcineurin positively regulates calcium-dependent signaling", "encodes an ortholog of the cytoskeletal protein alpha-adducin (ADD1); by homology, ADD-1 is predicted to be a cell membrane-associated protein that mediates localized changes in the cytoskeleton in response to activation of signal transduction cascades; in C. elegans, ADD-1 activity is required for short- and long-term memory, specifically for regulation of actin cytoskeleton organization and regulation of GLR-1 ionotropic glutamate receptor dynamics in the AVA command interneuron.", "A member of the forkhead domain family of transcription factors that affects the generation of the AWA and ASG chemosensory neurons and is partially required for male tail morphogenesis and embryogenesis; it is expressed in the AWA and ASG precursors; it is required for the graded spatial expression of the UNC-129 TGF-beta guidance factor.", "encodes a serotonin-gated chloride channel", "efn-2 is an ortholog of human EFNB1 (ephrin B1) and EFNB3 (ephrin B3); efn-2 is involved in inductive cell migration and negative regulation of ovulation.", "encodes one of four C. elegans AP-2-like transcription factors", "encodes a paired-like homeodomain transcription factor that is one of three orthodenticle (OTX/OTD) homeodomain proteins in C. elegans (the others being TTX-1 and CEH-37).", "encodes a homeodomain-containing protein that is orthologous to the Pitx family of homeodomain transcription factors.", "encodes a conserved member of the CRMP/TOAD/Ulip/DRP family of proteins that includes mammalian CRMP-2 (Collapsin response mediator protein-2), which is essential for axon guidance and axonogenesis", "encodes one of five C. elegans Wnt signaling molecules that is homologous to mammalian Wnt5; cwn-2 is required for proper placement of the nerve ring and anterior cells along the anterior/posterior axis; cwn-2 also acts redundantly to specify cell fates during vulval development.", "also known as, rgef-2, encodes a Ca2+-regulated Ras nucleotide exchange factor orthologous to human Ras guanyl-releasing protein (RasGRP).", "encodes a netrin orthologous to the human and mouse netrin-1 precursor proteins. UNC-6 functions as a guidance molecule that regulates circumferential axon migrations as well as migration of mesodermal cells.", "encodes a basic helix-loop-helix transcription factor that is required for development of several types of neurons, including the touch receptor neurons and the male sensory ray neurons.", "encodes a Rho guanyl-nucleotide exchange factor (RhoGEF) with similarity to the mammalian PLEKHG5/Tech/Syx RhoGEFs. RHGF-2 induces cell rounding inhibits neurite outgrowth; RHGF-2 functions as a RhoGEF for the RHO-1 GTPase; RHGF-2 physically interacts with the multi-PDZ domain scaffold protein MPZ-1.", "is an ortholog of members of the human TBX (T-boxes) family including TBX21; tbx-9 is involved in axonal fasciculation, body morphogenesis, embryo development and nematode larval development; tbx-9 exhibits RNA polymerase II regulatory region sequence-specific DNA binding activity and is predicted to have transcription factor activity, sequence-specific DNA binding, based on protein domain information.", "encodes a novel transmembrane vesicular GABA transporter; UNC-47 and UNC-46, a predicted novel transmembrane protein, are required in GABAergic neurons for all GABA neurotransmission, specifically for loading of GABA into synaptic vesicles, where UNC-47 is localized.", "encodes the C. elegans ortholog of the GABA neurotransmitter biosynthetic enzyme, glutamic acid decarboxylase (GAD); unc-25 activity is required for GABA synthesis and thus for normal synaptic transmission and GABA-mediated behaviors.", "encodes a homeodomain protein of the NK-2 family; ceh-28 is expressed in a single pharyngeal neuron, M4; within M4, CEH-28 functions to positively regulate the expression of dbl-1, which encodes a TGF-beta, and hence, TGF-beta signaling to ensure proper morphology of the pharyngeal g1 gland cells that are located adjacent to M4.", "encodes a REF-1-like protein with two bHLH domains that represses lag-2 transcription in ABa descendants and tbx-37 transcription in EMS descendants; lag-2 repression by HLH-26 may require UNC-37; HLH-26's paralogs include HLH-25 through HLH-29 and (more distantly) REF-1.", "encodes a homeodomain protein that is orthologous to vertebrate Hex proteins required for the development of B lymphocytes and organs derived from foregut endoderm; in C. elegans, pha-2 is essential for proper development and morphogenesis of the pm5 pharyngeal muscles cells during late stages of embryogenesis; in regulating pm5 fate specification, PHA-2 appears to act downstream of the organ identity factor PHA-4, and upstream of ceh-22, whose expression it may negatively regulate in pm5.", "encodes a FoxA transcription factor; during embryonic development, PHA-4 functions as an organ identity gene whose activity is necessary and sufficient for development of the pharynx/foregut; in addition, PHA-4 plays a key role in regulation of diet-restriction-induced longevity in adult animals.", "rpm-1 encodes an E3 ubiquitin ligase that contains an N-terminal RCC1 (regulator of chromosome condensation)-like guanine nucleotide exchange factor (GEF) domain and that is orthologous to Drosophila highwire and murine Phr1; RPM-1 functions autonomously within several different types of neurons to regulate presynaptic differentiation; in regulating axon termination, RPM-1 acts through the GLO-4 guanine nucleotide exchange factor that positively regulates vesicular trafficking through GLO-1/Rab; in regulating synaptogenesis, RPM-1 functions as part of an SCF-like ubiquitin ligase complex that negatively regulates signaling through the DLK-1 MAP kinase cascade; RPM-1 is expressed in most, if not all, neurons from the comma stage of embryogenesis through adulthood; RPM-1 expression is also seen in the pharynx, coelomocytes, and distal tip cells; in neurons, RPM-1 localizes to presynaptic terminals.", "kal-1 encodes a cell surface protein that contains a WAP-type protease inhibitor domain and Type III fibronectin domains and is the C. elegans ortholog of human KAL-1, mutated in the X-linked form of the neurological disorder Kallmann syndrome; in C. elegans, both kal-1 loss-of-function mutations and kal-1 overexpression result in similar phenotypes that indicate KAL-1 activity is required for epithelial morphogenesis and axon branching; kal-1 transcriptional reporters reveal expression beginning in the 50-cell stage embryo in 2-3 cells with later embryonic expression in at least 8-10 AB-derived ventral neuroblasts that are a substrate for migrating epidermal cells during ventral enclosure; later expression in larvae and adults is restricted to anterior neurons, including AIY, AIZ, RID, M5, ASI, and labial sensory neurons, ventral nerve cord motorneurons, midbody neurons HSN, CAN, and PVM, tail neurons DVB, DVC, and PDB, and the nonneuronal excretory cell as well as in uterine muscles; in the AIY interneurons, kal-1 is part of a gene battery whose expression is under the control of the CEH-10 and TTX-3 Paired and LIM-type homeodomains, respectively.", "max-1 encodes a novel, conserved PH/MyTH4/FERM domain-containing protein; max-1 activity is required cell-autonomously in motor neurons for UNC-6-mediated, dorsally directed axon guidance, proper axon extension and axon fasciculation in the nerve cords, and fully normal backward locomotion; genetic analyses indicate that max-1 likely acts downstream of unc-6 and unc-5, and in parallel to unc-40 and unc-129, to regulate axon guidance; max-1 expression begins during later stages of embryogenesis and continues through adulthood; expression is seen in motor neurons that extend circumferential processes, other neurons and, for the short form of MAX-1, body wall muscles; in neurons, MAX-1 localizes to processes but is excluded from cell bodies in a manner dependent upon the FERM domain, which appears critical for MAX-1 function.", "syg-2 encodes a transmembrane protein that is a member of the immunoglobulin superfamily of proteins; during larval development, SYG-2 activity is required in vulval epithelial cells for proper synaptic specificity of the HSNL neuron; in regulating synapse formation, SYG-2 acts as a guidepost protein for the SYG-1 receptor that interacts with SYG-2 and acts within HSNL to regulate synaptic specificity; a SYG-2::GFP fusion protein is expressed in the primary vulval cell lineages beginning at the L3 larval stage, with expression increasing during the L4 stage and finally disappearing by adulthood; in embryos, SYG-2::GFP expression is detected in some head neurons and body wall muscles, the latter of which also express the reporter during the L1 and L2 larval stages.", "ceh-14 encodes a LIM homeodomain protein orthologous to Drosophila Lim3 and the vertebrate Lhx3 and Lhx4 proteins; ceh-14 is required for specification of the AFD thermosensory neurons and for normal thermotactic behavior; a ceh-14::GFP reporter fusion is expressed in head and tail neurons, including the AFD thermosensory neurons, during late embryonic, larval, and adult stages. Animals triply mutant for the LIM homeobox genes ceh-14, lin-11, and ttx-3 which are required for function of the AFD, AIZ, and AIY neurons, respectively, exhibit a basic cryophilic thermotaxis response suggesting that, in C. elegans, there is more than one pathway for integration of thermosensory input.", "ceh-37 encodes one of three C. elegans proteins with an OTX-like homeodomain; however, CEH-37 lacks other domains found in OTX proteins, and the CEH-37 homeodomain is predicted to resemble the Myb domain of telomere-binding proteins; CEH-37 binds the telomeric sequence 'TTAGGC' if it is repeated at least 1.5 times, and is mainly localized to the telomere in vivo; ceh-37 mutants have a weak increase in chromosomal nondisjunction; CEH-37 is involved in specifying some aspects of the AWB olfactory neuron fate, such as expression of an AWB-specific odorant receptor and a LIM-class homeodomain protein, LIM-4; CEH-37 is expressed broadly in the early embryo, while in larvae and adults it is expressed solely in the excretory cell.", "daf-8 encodes a Smad protein that represses dauer development, perhaps by antagonizing DAF-3 activity, and promotes a commitment to reproductive growth; genetic interactions suggest partial functional redundancy with daf-14 with respect to the TGF-beta signaling pathway that regulates dauer formation.", "nlr-1 is an ortholog of human CNTNAP3 (contactin associated protein-like 3), CNTNAP5 (contactin associated protein like 5), CNTNAP1 (contactin associated protein 1), CNTNAP3B (contactin associated protein-like 3B), CNTNAP4 (contactin associated protein like 4) and CNTNAP2 (contactin associated protein-like 2); nlr-1 is involved in embryo development, nematode larval development and reproduction; nlr-1 is predicted to have calcium ion binding activity, based on protein domain information; nlr-1 is expressed in the pharynx, anal depressor muscle, g1P, g1AR, and the nervous system.", "ins-5 encodes an insulin-like peptide of the insulin superfamily of proteins; INS-5 is one of 38 insulin-like peptides in C. elegans and is expressed in the amphid sensory neurons, labial neurons, the nerve ring, other neurons, and the vulva; the precise role of INS-5 in C. elegans development is not yet clear as loss of function does not result in a mutant phenotype.", "egl-5 encodes a homeodomain transcription factor, orthologous to Drosophila Abd-B and the vertebrate Hox9-13 proteins, that is required for specification of the HSN cell fate and of cell fates within the tail region; EGL-5 is expressed in the posterior of the animal.", "egl-13 encodes a SOX domain transcription factor; egl-13 is required for maintenance of the uterine pi cell fate; mutations in egl-13 affect the cell fusion process that makes the vulval-uterine connection and consequently egg laying; egl-13 is expressed in the pi cells, transiently expressed in the rho lineage, in the anchor cell following fusion, and in neurons, body wall muscles, and intestinal cells; egl-13 expression during pi cell fate specification is dually controlled by LAG-1 and FOS-1/JUN-1.", "ceh-63 encodes a homeobox protein of uncertain affinity, but with some similarity to vertebrate Hox3 proteins and the D. melanogster homeobox protein ROUGH; ceh-63 is expressed in a single tail neuron of hermaphrodites from late embryo to adult stages, as well as in a uterus cell separate from the vulva (perhaps in the spermetheca).", "crml-1 is an ortholog of human LRRC16B, RLTPR and LRRC16A; crml-1 is involved in negative regulation of Rac protein signal transduction and functions in regulation of axon extension involved in axon guidance, regulation of cell migration and striated muscle myosin thick filament assembly; crml-1 exhibits GTPase activating protein binding activity.", "ceh-38 encodes two proteins, by alternative splicing, that belong to the ONECUT class of homeodomain proteins (which includes mammalian hepatocyte nuclear factor-6)", "ins-17 encodes an insulin-like peptide.", "casy-1 encodes a type I transmembrane protein with two extracellular cadherin domains and an LG/LNS domain that is the sole C. elegans calsyntenin/alcadein ortholog; genetic studies indicate that in C. elegans casy-1 activity is required, in parallel to the insulin-like signaling pathway, for several types of learning, including salt chemotaxis learning, temperature learning, olfactory adaptation, and integration of two sensory stimuli; large-scale RNAi experiments also suggest that casy-1 plays a role in embryonic development; casy-1 expression in adult animals is able to rescue salt chemotaxis learning defects, indicating that CASY-1 function in mature animals is sufficient to effect proper chemotactic behavior; in addition, CASY-1 expression in the ASER neuron, but not other neurons, rescues salt chemotaxis learning defects, indicating the CASY-1 can act solely in this chemosensory neuron for normal salt chemotaxis learning", "cysl-1 encodes a homolog of sulfhydrylases/cysteine synthases; CYSL-1 functions in neurons to transduce signals from H2S (hydrogen sulfide), which accumulates during hypoxia, to the EGL-9 proline hydroxylase to regulate O2-dependent behavioral plasticity in C. elegans via neuronal activation of the HIF-1 hypoxia-inducible transcription factor", "inx-13 encodes an innexin, an integral transmembrane channel protein that is a structural component of invertebrate gap junctions; INX-13 is essential for larval development and osmoregulation, and may be a component of the gap junctions that link the excretory and hypodermal cells; INX-13 is expressed embryonically in hypodermis and post-embryonically, in hypodermal seam cells, the excretory cell, and the developing vulva and spermatheca; in hypodermal cells, INX-13 localizes to the plasma membrane at points of contact between adjacent cells.", "pde-2 is an ortholog of human PDE2A (phosphodiesterase 2A); pde-2 is involved in cGMP catabolic process, negative regulation of cyclic nucleotide-gated ion channel activity, positive regulation of cGMP-mediated signaling and response to oxygen levels; pde-2 is predicted to have 3',5'-cyclic-nucleotide phosphodiesterase activity, based on protein domain information; pde-2 is expressed in the pharynx, anal depressor muscle, nervous system, reproductive system, pharyngeal-intestinal valve, intestine, and the body wall musculature.", "ceh-20 encodes one of three C. elegans homeodomain proteins (CEH-20, CEH-40, and CEH-60) homologous to Extradenticle (Exd/Pbx); together with ceh-40 and unc-62, ceh-20 activity is required for embryonic viability; ceh-20 is also required as a cofactor for LIN-39- and MAB-5- dependent postembryonic mesoderm patterning; in addition, ceh-20 is required for regulating post-embryonic migrations of the Q neuroblast descendants and for regulating vulval development.", "agr-1 encodes a large (1396-residue) putative agrin, orthologous to human AGRIN (OMIM:103320), EGFLAM, and Q9NQ15; AGR-1 is expressed in buccal epithelium and deposited in pharyngeal basal epithelium; AGR-1 is also expressed in IL1 neurons, distal tip cells, and intestine; an AGR-1 fragment can cluster vertebrate dystroglycan in cell culture; agr-1(eg1770) mutations show no obvious phenotype, including levimasole resistance, and do not enhance other mutations perturbing acetylcholine signalling, the dystrophin-glycoprotein-complex, muscle cell differentiation, or the extracellular matrix.", "nphp-4 encodes an ortholog of human NPHP4 (OMIM:607215, mutated in juvenile nephronophthisis and Senior-Loken syndrome-4) that is required for normal chemotaxis, lifespan, and male mating behavior; NPHP-4 is expressed in diverse neurons (amphid and phasmid sensory, URX, labial, male lumbar and cloacal ganglia, and male-specific CEM, HOB and RnB); within neurons, NPHP-4 is a ciliary protein, localized to the transistion zone at cilial bases rather than ciliary axonemes, and absent from somata, axons, or dendrites; NPHP-4 colocalizes with NPHP-1 and PKD-2 in male-specific sensory cilia, and is required for the normal ciliary localization of NPHP-1; NPHP-4 expression requires DAF-19, and mutating an X-box in nphp-4's promoter abolishes nphp-4 expression; NPHP-4 is required for NPHP-1's localization to transistion zones; morphologically, nphp-4 mutant cilia are normal, indicating a function for NPHP-4 in signal transduction.", "mir-51 encodes a microRNA, a small non-protein coding RNA and has a potential ortholog in C. briggsae; mir-51 is expressed constitutively throughout development; many of the known microRNAs are involved in post-transcriptional regulation of genes; the precise function of mir-51 is not known.", "mir-45 encodes a microRNA, a small non-protein coding RNA and is conserved in C. briggsae; the last miRNA of the 42-mir-44 cluster of miRNAs is also represented by mir-45 which is not part of the cluster; mir-45 is expressed at all life stages; many of the known microRNAs are involved in post-transcriptional regulation of genes.", "bbs-8 encodes a tetratricopeptide repeat (TPR)-containing protein that is orthologous to the human Bardet-Biedl syndrome protein, BBS8; in C. elegans, bbs-8 activity is required for cilia biogenesis and function; accordingly, bbs-8 mutant animals display odorant chemotaxis defects and exhibit both aberrant motility and abnormal localization of at least two intraflagellar transport (IFT) protein markers; bbs-8 is also required for the proper regulation of insulin secretion; bbs-8, bbs-5, bbs-1, and bbs-9 mutants along with ciliary phenotypes show an increased secretion of insulin, biogenic amines and neuropeptides, which requires the Rab27/AEX-6 dense-core vesicle exocytosis machinery.", "inx-19 encodes an innexin, proteins that form gap junction channels; inx-19 functions in parallel with the NSY-4 claudin to specify the AWC chemosensory neuron ON fate; in specifying the AWC on fate, inx-19 appears to function cell autonomously; inx-19 also regulates body size and growth.", "osm-5 encodes the ortholog of the murine polycystic kidney disease gene Tg737 (which encodes the protein Polaris) and human IFT88; osm-5 is required for the proper morphology of the cilia of chemosensory neurons and is involved in intraflagellar transport; the abnormalities in cilia structure in osm-5 mutants lead to defects in several processes like osmotic avoidance, chemotaxis, dauer formation, male mating and life span; osm-5 is expressed in ciliated sensory neurons and localizes to the transition zones of the amphids, phasmids, labials and rays of the male tail; osm-5 expression is regulated by the RFX-type transcription factor, DAF-19, that also regulates the expression of other genes involved in cilia formation.", "ast-1 encodes one of ten C. elegans ETS-box transcription factors; AST-1 is required cell autonomously for proper initiation and maintenance of dopamine (DA) neuron fate; AST-1 acts to specify DA neuron fate by positively regulating expression of a number of DA neuron-specific genes such as dat-1 and cat-2, which encodes a dopamine transporter and tyrosine hydroxylase, respectively; AST-1 is also required for proper navigation of some interneuron axons to their targets, for differentiation of the ventral cord pioneer neuron AVG, and for pharyngeal morphogenesis; AST-1 is transiently expressed in many head neurons late in their differentiation and axon outgrowth, and in a few pharyngeal cells", "cng-3 is an ortholog of members of the human CNG (Cyclic nucleotide gated channels) family including CNGA1; cng-3 is involved in multicellular organismal reproductive process, positive regulation of growth rate and response to heat; cng-3 is predicted to have ion channel activity, based on protein domain information; cng-3 is expressed in certain amphid neurons; cng-3 is localized to the non-motile cilium.", "unc-62 encodes a Meis-class homeodomain protein required for posterior embryonic morphogenesis, male tail morphogenesis, commissure formation by VD and DD motor neurons, vulval morphogenesis, and normal locomotion; UNC-62 is orthologous to Drosophila HOMOTHORAX.", "nhr-2 encodes a member of the nuclear hormone receptor family that is required for embryonic viability and morphogenesis; expressed during embryogenesis.", "ceh-48 encodes a ONECUT class CUT homeobox protein with a single N-terminal cut domain; the cut domain may be a compact DNA-binding domain composed of alpha helices; CEH-48 is strongly affiliated with, and may be orthologous to, Drosophila ONECUT and mammalian HNF6 proteins; ceh-48 has no obvious function in mass RNAi assays.", "lim-6 encodes a LIM class homeodomain protein that contains two Zinc-finger-like LIM domains N-terminal to a predicted DNA-binding homeodomain; LIM-6 is predicted to function as a transcription factor whose activity is required for regulating uterine morphogenesis and specific aspects of terminal neuronal differentiation, including normal axonal morphology, full expression of UNC-25/glutamic acid decarboxylase in select GABAergic neurons, and repression of sensory receptor gene expression in the ASEL chemosensory neuron.", "rab-3 encodes a rab3 homolog, a member of the Ras GTPase superfamily, and affects sensitivity to aldicarb and the distribution of synaptic vesicle populations and thereby affects synaptic transmission, track amplitude and speed of movement, chemotaxis to isoamyl alcohol, affects pharyngeal pump durations, and may only slightly affect male mating behavior; requires aex-3 for localization to synapse-rich regions in axons and it is expressed in most or all neurons.", "unc-42 encodes a paired-like homeodomain protein of the Q50 class; UNC-42 is required to specify the fate of ASH sensory neurons, AVA, AVD, and AVE interneurons, and a subset of motor neurons", "", "", ""], "spatial_expression_patterns": ["head, body wall, pharyngeal cell (?)", "Expression in both the AFD as well as in the marginal cells, although was first observable well after the time when the AFD neurons were born and was maintained throughout development.", "motorneurons in the ventral cord and in neurons in tail ganglia, nuclei in the head as embryo, neuronal cells in the head and pharynx.", "Early embryos show a patch of expression at one end that presumably is anterior because comma stage embryos show expression in anterior cells. From late embryogenesis to adult, expression is observed in four nerves in the head one (or possibly two) of which have processes down the ventral side to the tail. Weak expression is also seen in the intestine.", "head amphids and tail phasmids", "Expression in several head neurons (head-nerve ring) throughout larval and adult stages.", "Expression in head-nerve ring, amphid neurons, sheath cells of the cephalic sensilla", "dim expression in head and tail regions, bright Nerve ring expression", "anterior neurons", "Broad neuronal expressor", "Anterior neurons", "Anterior neurons", "Anterior neurons", "Embryonic cells (body muscle precursors) and body wall muscles cells", "In WT animals, wrk-1 was expressed in several neurons in the C. elegans nerve ring. The wrk-1 gene is expressed in ventral midline cells, namely in the eMNs. Additional expression is observed in a subset of head neurons, including interneurons (AIY class), sensory neurons (ASI class), and head motoneurons (SMDV/D class), and glial-type sheath and socket cells.", "rig-1 is expressed in the AMsoR, AMsoL, lateral ganglion, certain interneurons, all pharyngeal neurons, pharyngeal muscle cell, hypodermis, and certain head motor neurons.", "expression mostly in sensory neurons, including the thermosensory AFD neurons, the chemosensory.", "ADD-1 was expressed throughout the life cycle of C. elegans.", "Embryonic expression is first observed at about the 60-cell stage, when it is expressed in the nuclei of four cells. As embryogenesis continues, UNC-130 becomes more broadly expressed in several cell types.", "Expressed in the cell bodies and axons (the latter presumably due to overexpression) of neurons in the head, tail, and ventral nerve cord.", "efn-2 is expressed in the pm6VR, pm5VR, M cell, exc_gl_R nucleus, exc_gl_L nucleus, arc ant V, hyp2, G1, certain interneurons, certain inner labial neurons, certain ventral cord neurons, certain amphid neurons, hyp7 syncytium, MSappapp, certain outer labial neurons, neuroblast, and certain head motor neurons.", "APTF-1 activity is required in the RIS interneuron for sleep-like quiescence induced by neuropeptide signaling; aptf-1 is expressed in five head interneurons. aptf-1 was expressed strongly during late embryogenesis and early larval development in three types of interneurons, the paired neurons AIB and RIB and the unpaired neuron RIS. The expression in RIS was the strongest.", "CEH-36 is required broadly for specification of the AWC olfactory neuron and also for establishing the left-right asymmetry of the ASEL and ASER gustatory neurons; in addition, CEH-36 is sufficient to specify the AFD thermosensory neuron fate in some cell types; CEH-36 is expressed in the AWC and ASE chemosensory neurons.", "During develpoment, UNC-30 controls the terminal differentiation of all 19 type D GABA-ergic motor neurons by directly regulating the expression of UNC-25/GAD and UNC-47/VGAT, which regulate GABA formation and secretion, respectively; UNC-30 is expressed most strongly in type D motor neurons during early L1 and L2 larval stages.", "unc-33 is expressed in dividing neuroblasts at pre-comma embryonic stages, amphid socket cells and weakly in non-neuronal pharyngeal cells.", "CWN-2 appears to be required at the time of nerve ring development (comma stage of embryogenesis) for nerve ring placement and likely functions as a signaling ligand for receptors, such as CAM-1, that regulate axon guidance of the SIA and SIB neurons that plays a role in nerve ring placement. CWN-2, along with LIN-17, CAM-1, and DSH-1, functions as part of a Wnt signaling pathway that regulates ACR-16 localization to postsynaptic regions, a key component of activity-dependent synaptic plasticity. In embryos at the comma stage, cwn-2 is expressed in the intestine and in pharyngeal muscle; in larvae and adults, cwn-2 is expressed in the intestine, pharynx, anterior body wall muscle, vulva and SMD head neurons.", "rgef-1 is expressed in post-mitotic neurons (pan-neuronally) beginning at the late comma stage of embryogenesis.", "UNC-6 is first expressed during embryogenesis in ventral epidermoblasts; additional expression is seen in neurons and sheath cells.", "lin-32 is expressed in Rn cells, and epidermal ray precursor cells in male tails.", "RHGF-2 is expressed in many, but not all, C. elegans neurons from the 1.5-fold stage of embryogenesis through adulthood; in nerve ring axons, RHGF-2 expression overlaps with that of MPZ-1.", "tbx-9 is expressed in the muscle cell, E, hypodermis, intestinal cell, Ca, Epl, ABarpa, ABarpp, Cp, ABplaa, Ear, Eal, Epr, Ep, and the Ea.", "UNC-47 expression in type D neurons is transcriptionally regulated by the UNC-30 homeodomain protein. Expressed in all GABAergic neurons, which include the 19 D neurons in the ventral cord, the four RMEs, AVL, and RIS in the head, and DVB in the tail.", "UNC-25 is expressed specifically in the 26 GABAergic neurons as soon as they are generated and localizes to cell bodies, axonal branches, and synaptic regions, including some localization to synaptic vesicles; in the 19 type D GABAergic neurons.", "", "", "pha-2 is expressed in some cells of the pharyngeal primordium, the pm5 muscles during ate stages of embryogenesis, the I4 interneuron, and the pharyngeal epithelial cells.", "PHA-4 expression begins early in embryogenesis and is seen in pharyngeal and intestinal cells (foregut and midgut); PHA-4 is also expressed later in the developing somatic gonad.", "head neurons, epidermal cells, nerve ring", "ventral neuroblasts that are a substrate for migrating epidermal cells during ventral enclosure; later expression in larvae and adults is restricted to anterior neurons, including AIY, AIZ, RID, M5, ASI, and labial sensory neurons, ventral nerve cord motorneurons, midbody neurons HSN, CAN, and PVM, tail neurons DVB, DVC, and PDB, and the nonneuronal excretory cell as well as in uterine muscles", "head neurons, ventral and doral nerve cord", "epidermal cells, nerve ring, PLN, PVT, RIC, RIM, DD, DA, DB, AIZ, ALN, hypodermis", "AFD, AIZ, ALN, AIM, BDU, ALM and AIY neurons, tail neurons", "head neurons, amphids", "head neurons, excretory cells, tail neurons, ventral nerve cord", "head neurons, VNC, dorsal nerve cord", "nerve ring neuron, head neuron, motor neuron, outer labial neuron, inner labial neuron, head muscle, tail neuron", "head neuron, excretory cell, tail muscles", "tail neuron, nerve ring neuron, intestinal cells, head neurons, amphid neuron, body wall musculature", "tail neuron", "epithelial cell, pharynx, nervous system, excretory canal, rectal epithelium, vulva, and the DTC", "pharynx, gut, hypodermis and many nerve cells, excretory canal, intestinal cells, tail neurons", "head neurons, head muscles, motor neuron, nerve ring neurons, pharyngeal neuron, excretory canal cell, ventral nerve cord?", "nerve ring", "head neurons, body wall musculature, intestine, hypodermis", "head neurons, intestine, pharyngeal muscle?", "head neurons, nerve ring, intestine", "head neurons, hypodermis, intestine, bodywall musculature, tail neurons", "head neurons, intestine, body wall musculature?, arcade cells", "amphids, head neurons", "head neurons, hypodermis, other cells", "head neurons", "amphid neurons, ciliated neurons, head neurons, inner labial neuron, nerve ring, outer labial neurons", "tail neuron, head neurons", "amphids, head neurons, inner labial neurons", "head neurons, inner labial neurons", "head neurons, body muscles, pharyngeal neurons?, amphids (late embryonic development)", "head neurons, body wall muscles", "Ubiquitous in the worm", "Anterior region of the animal, pan-neuronal", "A few cells in the head of the animal", "Pan-neuronal", "20-30 cells in the head", "", "", ""], "cellular_expression_patterns": ["AIB (only in 3 fold stage)\n\nExpression Details Strain Information", "AFD and marginal cells\n\nExpression Details Strain Information", "lineaging data: RMDDL, RMDDR, I4, I5, AVDL, AVDR\n\nExpression Details Strain Information", "Expressed very early in the embryo in about 20-30 cells, but decreases in later stages. Visible expression in neurons have such as AIB, AVJ, and RIV.\n\nExpression Details Strain Information", "Predominantly expressed in sensory neurons (10 neuronal pairs: AWC, ASE, AWB, BAG, PHB, AWA, AFD, ADF, ASG, PHA). In addition, two pairs of interneurons (AVK, AIY), one motor neuron (RMG), and one muscle cell type (pm1).\n\nExpression Details Strain Information", "Lineaging data: SMDD, AIY, AIN\n\nExpression Details Strain Information", "Expressed in CEPsh cells at all developmental stages and in some motoneurons of the ventral cord in larvae.\n\nExpression Details Strain Information", "Unknown\n\nExpression Details Strain Information", "lineaging data: AVDL, AVDR, RMDDL, RMDDR, SMBDL, SMBDR\n\nExpression Details Strain Information", "Broad neuronal expression in many different neurons, including nerve ring, amphids, ventral never cord etc.\n\nExpression Details Strain Information", "10-15 neurons in the nerve ring, pharyngeal, and amphids (6ish are much brighter than others). Predicted to be in AIY, SMDD, SIBV, SIAD.\n\nExpression Details Strain Information", "16 neurons in the nerve ring, and amphids. Lineaged by Bao Lab to be expressed in SMDV, RIV, SAAV, SIBV, SIAD, SMDD, SIBD, SIAV.\n\nExpression Details Strain Information", "3 bright neurons in the nerve ring, Identity unknown but appears to be an interneuorn.\n\nExpression Details Strain Information", "HLH-1 is expressed in nuclei and first appears in bodywall muscle precursors beginning at the ~80-cell stage of embryogenesis; expression then continues in these cells and their differentiated descendants throughout embryonic, larval, and adult stages of development.\n\nExpression Details Strain Information", "ventral cord, head neurons\n\nExpression Details Strain Information", "Neuronal expression in AVA, AVB, AVD, AVE, PVC, AIB, AIN, AUA, AVH?, AVJ, RIC, RMD, SMD, I2.\n\nExpression Details Strain Information", "ASE, AWA, and AWC neurons, and the osmosensory ASH neurons\n\nExpression Details Strain Information", "Expressed in several tissues, including the intestine and rectal epithelia, the coelomocytes, the seam cells, as well as the nervous system (AVA, AVB, AVD, AVE, AVJ, PVC, AIB, RIM, RMD, SMD, GLRD, ASJ, RME). In the head and tail ganglia, ADD-1 expression largely overlapped with the ionotropic glutamate receptor, GLR-1.add-1 expression was also detected in the CAN neurons.\n\nExpression Details Strain Information", "ABp(l/r)aapapa cells, which give rise to the AWA and ASG neurons. Also in other neuronal precursors including the ABp(l/r)aapapp cells, which are the precursors to the AIB interneurons and the ASI chemosensory neurons.\n\nExpression Details Strain Information", "MOD-1 is expressed in the AIA, AIB, RME, AIY, AIZ, RIM, RME and RID interneurons, as well as in a number of additional uni- dentified neurons in the head, ventral cord and tail. In addition, mod-1 is expressed in RIM and RIC interneurons.\n\nExpression Details Strain Information", "head neurons, ventral cord neurons, epidermal cells\n\nExpression Details Strain Information", "RIS interneuron and other head interneurons\n\nExpression Details Strain Information", "Very strong expression specific to head neurons. Expression in ASE and AWC chemosensory neurons.\n\nExpression Details Strain Information", "UNC-30 is found in the nuclei of the DD and VD neurons and ASGL, ASGR, RIH and RID.\n\nExpression Details Strain Information", "neuroblasts, ventral nerve cord and nerve ring\n\nExpression Details Strain Information", "nerve ring, intestine and in pharyngeal muscle, vulva and SMD head neurons\n\nExpression Details Strain Information", "throughout the nervous system (pan-neuronal), head neurons, nerve ring, tail neurons, and nerve cord.\n\nExpression Details Strain Information", "lineaging data: DD3, DD5, PHAL, PHAR\n\nExpression Details Strain Information", "nine Rn.a neuroblasts and their progeny, Rn.aa and Rn.ap cells\n\nExpression Details Strain Information", "head and tail ganglia and many neuronal processes in the nerve ring and ventral cord\n\nExpression Details Strain Information", "gut, muscle and hypodermis\n\nExpression Details Strain Information", "all GABAergic neurons, D neurons in the ventral cord, RMEs, AVL, and RIS in the head, SDQ neurons, and DVB in the tail\n\nExpression Details Strain Information", "all GABAergic neurons, which include the 19 D neurons in the ventral cord, the four RMEs, AVL, and RIS in the head, and DVB in the tail\n\nExpression Details Strain Information", "single nerve in the pharynx, possibly M4\n\nExpression Details Strain Information", "expression in ABp descendants\n\nExpression Details Strain Information", "expressed in pharyngeal cells, intestinal-rectal cells, and postembryonic head neurons\n\nExpression Details Strain Information", "E descendants, Pharyngeal cells derived from both AB and MS lineages, intestine, rectal cells,epithelial cells, muscle cells, marginal cells, gland cells, distal tip cell and ventral uterine cells\n\nExpression Details Strain Information", "Expression Details Strain Information", "Expression Details Strain Information", "DD4, DB6, and DA6. BDU, SDQ, and AVM neurons\n\nExpression Details Strain Information", "Expression Details Strain Information", "Expression Details Strain Information", "lineaging data: AWC, SAAV, ADF, AWB, AVAR\n\nExpression Details Strain Information", "ASI, ADL, VNC\n\nExpression Details Strain Information", "lineaging data: SMBDL, SMBDR, URADL, URADR, PHBL, PHBR\n\nExpression Details Strain Information", "VNC, ASI, ASK, amphid neuron\n\nExpression Details Strain Information", "Expression Details Strain Information", "lineaging data: BAG, AFD, RMGR, FLPR (parent), AIZR (parent), i5\n\nExpression Details Strain Information", "DVC\n\nExpression Details Strain Information", "Expression Details Strain Information", "Expression Details Strain Information", "lineaging data: AVDL/R, AVJL/R, RMDDL/R\n\nExpression Details Strain Information", "amphids, nerve ring interneurons\n\nExpression Details Strain Information", "Expression Details Strain Information", "Expression Details Strain Information", "amphids, nerve ring interneurons, intestine\n\nExpression Details Strain Information", "Q neuroblast, amphids?, interneurons, tail neurons, intestine\n\nExpression Details Strain Information", "IL1 neurons, arcade cells and epithelial buccal cells in the pharynx, and in few apoptotic cells\n\nExpression Details Strain Information", "Lineaging data: ADL, ASH, ASJ, AWB Note: Over-expression of nphp-4 leads to high embryo lethality\n\nExpression Details Strain Information", "head neurons, interneurons, arcade cells, ventral nerve cord\n\nExpression Details Strain Information", "Expression Details Strain Information", "Expression Details Strain Information", "ASH, AFD, AWC,\n\nExpression Details Strain Information", "Expression Details Strain Information", "OLL L/R, OLQD L/R, IL1 L/R, IL1D L/R, IL1V L/R\n\nExpression Details Strain Information", "Expression Details Strain Information", "ALM?,FLP?, excretory cell?\n\nExpression Details Strain Information", "Ubiquitous in the worm\n\nExpression Details Strain Information", "pan-neuronal expression\n\nExpression Details Strain Information", "AVL\n\nExpression Details Strain Information", "pan-neuronal expression\n\nExpression Details Strain Information", "AIB, ASH, other head neurons\n\nExpression Details Strain Information", "Expression Details Strain Information", "Cellular expression: AIAL/R, ADFL/R, RMDDR\n\nExpression Details Strain Information", "Cellular expression - RIM,RIC\n\nExpression Details Strain Information"], "image_urls": ["NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA", "NA"]}